Tekla.Structures.ModelInternal.TeklaStructuresApplicationWrapper


Tekla.Structures.ModelInternal.TeklaStructuresApplicationWrapper.Instance


Tekla.Structures.ModelInternal.TeklaStructuresApplicationWrapper.Functionality


Tekla.Structures.ModelInternal.TeklaStructuresApplicationWrapper.#ctor(Tekla.Structures.ModelInternal.ITeklaStructuresApplication,Tekla.Structures.Internal.WrapperFunctionalityBase)


Tekla.Structures.ModelInternal.TeklaStructuresApplicationWrapper.SharedModelStateChanged


Tekla.Structures.ModelInternal.TeklaStructuresApplicationWrapper.BeginGetSharingLocalChanges(Tekla.Structures.Internal.IAsyncCallCompletion{System.Collections.Generic.Dictionary{System.String,System.Collections.Generic.List{Tekla.Structures.ModelInternal.HistoryItem}}})


Tekla.Structures.ModelInternal.TeklaStructuresApplicationWrapper.BeginGetTCProjectsWithPointClouds(Tekla.Structures.Internal.IAsyncCallCompletion{System.Collections.Generic.IEnumerable{Tekla.Structures.Model.PointCloudDataServices.TCProject}})


Tekla.Structures.ModelInternal.TeklaStructuresApplicationWrapper.BeginGetTCPointCloudUrl(System.String,System.String,System.String,Tekla.Structures.Internal.IAsyncCallCompletion{System.String})


Tekla.Structures.ModelInternal.TeklaStructuresApplicationWrapper.BeginTestSharingOperationAsync(System.Boolean,Tekla.Structures.Internal.IAsyncCallCompletion{Tekla.Structures.ModelInternal.SharingResult})
/>

Tekla.Structures.ModelInternal.TeklaStructuresApplicationWrapper.BeginInviteSharingUserAsync(System.String,Tekla.Structures.Model.SharingRole,System.Boolean,System.String,System.Guid,Tekla.Structures.Internal.IAsyncCallCompletion{Tekla.Structures.ModelInternal.SharingResult})


Tekla.Structures.ModelInternal.TeklaStructuresApplicationWrapper.BeginGetSharedModelsAsync(Tekla.Structures.Internal.IAsyncCallCompletion{Tekla.Structures.ModelInternal.SharingResult{System.Collections.Generic.IEnumerable{Tekla.Structures.ModelInternal.SharedModel}}})


Tekla.Structures.ModelInternal.TeklaStructuresApplicationWrapper.BeginStartSharingAsync(System.String,System.String,System.Guid,Tekla.Structures.Internal.IAsyncCallCompletion{Tekla.Structures.ModelInternal.SharingResult{System.Guid}})


Tekla.Structures.ModelInternal.TeklaStructuresApplicationWrapper.BeginGetLocationsAsync(Tekla.Structures.Internal.IAsyncCallCompletion{Tekla.Structures.ModelInternal.SharingResult{Tekla.Structures.ModelInternal.SharingLocationsInformation}})


Tekla.Structures.ModelInternal.TeklaStructuresApplicationWrapper.BeginRemoveModelAsync(System.Guid,Tekla.Structures.Internal.IAsyncCallCompletion{Tekla.Structures.ModelInternal.SharingResult})


Tekla.Structures.ModelInternal.TeklaStructuresApplicationWrapper.BeginGetSharingUpdatesAsync(System.Guid,Tekla.Structures.Internal.IAsyncCallCompletion{Tekla.Structures.ModelInternal.SharingResult{System.Collections.Generic.List{Tekla.Structures.ModelInternal.SharingUpdate}}})


Tekla.Structures.ModelInternal.TeklaStructuresApplicationWrapper.BeginJoinSharedModelAsync(System.Guid,System.String,System.Guid,Tekla.Structures.Internal.IAsyncCallCompletion{Tekla.Structures.ModelInternal.SharingResult})


Tekla.Structures.ModelInternal.TeklaStructuresApplicationWrapper.BeginReadInAsync(System.Guid,Tekla.Structures.Internal.IAsyncCallCompletion{Tekla.Structures.ModelInternal.SharingResult})


Tekla.Structures.ModelInternal.TeklaStructuresApplicationWrapper.BeginWriteOutAsync(System.String,System.String,System.Boolean,System.String,Tekla.Structures.Internal.IAsyncCallCompletion{Tekla.Structures.ModelInternal.SharingResult})


Tekla.Structures.ModelInternal.TeklaStructuresApplicationWrapper.BeginReserveNextWriteOutAsync(System.String,Tekla.Structures.Internal.IAsyncCallCompletion{Tekla.Structures.ModelInternal.SharingResult})


Tekla.Structures.ModelInternal.TeklaStructuresApplicationWrapper.BeginReleaseNextWriteOutAsync(System.String,Tekla.Structures.Internal.IAsyncCallCompletion{Tekla.Structures.ModelInternal.SharingResult})
